app/views/articles/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = 1
---
<section id='comments'>
	<% @article.comments.each do |comment| %>