app/controllers/articles_controller.rb

  def index
    @articles = Article.all
---
SELECT "articles".* FROM "articles" ORDER BY created_at desc

  def edit
    if current_user
      @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    unless current_user
      redirect_to new_user_path, :notice =>'Necesitas un usuario para crear un articulo'
    end
    @article = Article.new(params[:article])
    @article.user_id = current_user.id

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("body", "created_at", "extension", "slug", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @article = Article.find(params[:id])

    respond_to do |format|
      if @article.update_attributes(params[:article])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "articles" SET "body" = 'Hey bienvenido a ecoding, éste es el primer artículo de ejemplo, bla bla bla, veamos si ésto se trunca', "updated_at" = '2012-09-02 16:10:12.442096' WHERE "articles"."id" = 1

  def destroy
    if current_user
      @article = Article.find(params[:id])
      if current_user.id == @article.user.id || current_user.id == 1
        @article.destroy
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", "6"]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 6]]