app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments"
---
	def index
		@commens = Comment.all

INSERT INTO "comments" ("article_id", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", nil], ["body", nil], ["created_at", Sun, 02 Sep 2012 17:34:45 UTC +00:00], ["updated_at", Sun, 02 Sep 2012 17:34:45 UTC +00:00]]
---
	def create
		article_id = params[:comment].delete(:article_id)
    	@comment = Comment.new
    	@comment.body = params[:comment][:body]
    	@comment.article_id = article_id
    	@comment.save(validate: false)