app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
<<<<<<< Updated upstream
    if current_user && (current_user.id == params[:id] || current_user.id == 1 )
        @user = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "salt" = 'PxYggtkNQuCE4ivLebAD', "crypted_password" = '$2a$10$3mreMwY02oz8MjmZk.rqpOWiFd5UBjIozohVzOkEp2UdHW5OyoLpG', "updated_at" = '2012-09-16 21:08:10.248181' WHERE "users"."id" = 1
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

INSERT INTO "users" ("created_at", "crypted_password", "email", "remember_me_token", "remember_me_token_expires_at", "salt", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
    if @user.save