app/controllers/welcome_controller.rb

SELECT "articles".* FROM "articles" LIMIT 5
---
	def index
		@articles = Article.limit(4)