app/views/categories/show.html.erb

SELECT "articles".* FROM "articles" INNER JOIN "categorizations" ON "articles"."id" = "categorizations"."article_id" WHERE "categorizations"."category_id" = 1
---
<section id='articles_index' class='row-fluid'>
	<% @category.articles.each do |article| %>